src/InformationRegisters/ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП/ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП</name>
  <resources>
    <name>ОписаниеИерархии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Система</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП/ManagerModule.bsl
///////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьОписание(ЭлементСтруктуры) Экспорт
	Результат 		= "";
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.ОписаниеИерархии КАК Описание
	             	  |ИЗ
	             	  |	РегистрСведений.ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП КАК ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП
	             	  |ГДЕ
	             	  |	ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.ЭлементСтруктуры = &ЭлементСтруктуры";
	Запрос.УстановитьПараметр("ЭлементСтруктуры", ЭлементСтруктуры);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Описание;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	Возврат Результат;
КонецФункции // ПолучитьОписание
